Clash Bot Workflow - plan
#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Workflow Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

#### Prerequisites
```

terraform
module.create_team_step_function.data.aws_caller_identity.current: Reading...
data.aws_iam_policy_document.event_handler_policy_document: Reading...
data.aws_acm_certificate.issued: Reading...
module.create_team_step_function.data.aws_region.current[0]: Reading...
module.clash_bot_event_sqs.aws_sqs_queue.this[0]: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/816923827429/clash-bot-event-sqs-development.fifo]
aws_iam_role.lambda_publisher_exec: Refreshing state... [id=clash_bot_lambda_event_publisher_exec_role]
aws_iam_role.lambda_handler_exec: Refreshing state... [id=clash_bot_lambda_event_handler_exec_role]
module.api_gateway.aws_apigatewayv2_api.this[0]: Refreshing state... [id=w6261upn4d]
module.dynamodb_table.aws_dynamodb_table.this[0]: Refreshing state... [id=clash-bot-workflow-development]
data.aws_iam_policy_document.event_handler_policy_document: Read complete after 1s [id=927500948]
module.create_team_step_function.data.aws_region.current[0]: Read complete after 1s [id=us-east-1]
aws_iam_policy.event_handler_policy: Refreshing state... [id=arn:aws:iam::816923827429:policy/ClashBotWorkflowEventHandlerPolicy]
module.create_team_step_function.data.aws_iam_policy_document.assume_role[0]: Reading...
module.create_team_step_function.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=4239894905]
module.create_team_step_function.aws_iam_role.this[0]: Refreshing state... [id=retrieve-teams-development]
module.create_team_step_function.data.aws_caller_identity.current: Read complete after 1s [id=816923827429]
module.create_team_step_function.data.aws_iam_policy_document.service["dynamodb"]: Reading...
module.create_team_step_function.aws_sfn_state_machine.this[0]: Refreshing state... [id=arn:aws:states:us-east-1:816923827429:stateMachine:retrieve-teams-development]
module.create_team_step_function.data.aws_iam_policy_document.service["dynamodb"]: Read complete after 0s [id=3233016293]
module.create_team_step_function.aws_iam_policy.service["dynamodb"]: Refreshing state... [id=arn:aws:iam::816923827429:policy/retrieve-teams-development-dynamodb]
aws_lambda_function.event_publisher_lambda: Refreshing state... [id=clash-bot-event-publisher]
aws_iam_role_policy_attachment.lambda_handler_exec_policy: Refreshing state... [id=clash_bot_lambda_event_handler_exec_role-20231113053238999600000002]
module.create_team_step_function.aws_iam_policy_attachment.service["dynamodb"]: Refreshing state... [id=retrieve-teams-development-dynamodb]
data.aws_acm_certificate.issued: Read complete after 1s [id=arn:aws:acm:us-east-1:816923827429:certificate/1d277044-1781-46f9-b693-50c8ff95546a]
module.api_gateway.aws_apigatewayv2_domain_name.this[0]: Refreshing state... [id=clash-bot.ninja]
aws_lambda_function.event_handler_lambda: Refreshing state... [id=clash-bot-event-handler]
aws_lambda_permission.apigw: Refreshing state... [id=AllowExecutionFromAPIGateway]
module.api_gateway.aws_apigatewayv2_integration.this["$default"]: Refreshing state... [id=5tztbve]
module.api_gateway.aws_apigatewayv2_stage.default[0]: Refreshing state... [id=$default]
aws_iam_policy.event_publisher_policy: Refreshing state... [id=arn:aws:iam::816923827429:policy/ClashBotEventPublisherPolicy]
module.api_gateway.aws_apigatewayv2_route.this["$default"]: Refreshing state... [id=ycntu3f]
aws_lambda_event_source_mapping.sqs_trigger: Refreshing state... [id=bf5ea823-a758-4eb0-88b5-bae1b4ed37b9]
aws_iam_role_policy_attachment.lambda_publisher_exec_policy: Refreshing state... [id=clash_bot_lambda_event_handler_exec_role-20231113053238957000000001]
module.api_gateway.aws_apigatewayv2_api_mapping.this[0]: Refreshing state... [id=cupiqn]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.event_publisher_policy_document will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "event_publisher_policy_document" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "sqs:DeleteMessage",
              + "sqs:GetQueueAttributes",
              + "sqs:ReceiveMessage",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + "arn:aws:lambda:us-east-1:816923827429:function:clash-bot-event-publisher",
            ]

          + principals {
              + identifiers = [
                  + "apigateway.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # aws_iam_policy.event_publisher_policy will be updated in-place
  ~ resource "aws_iam_policy" "event_publisher_policy" {
        id          = "arn:aws:iam::816923827429:policy/ClashBotEventPublisherPolicy"
        name        = "ClashBotEventPublisherPolicy"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                          - "logs:CreateLogGroup",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = [
                          - "sqs:ReceiveMessage",
                          - "sqs:GetQueueAttributes",
                          - "sqs:DeleteMessage",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags        = {}
        # (5 unchanged attributes hidden)
    }

  # aws_lambda_function.event_handler_lambda will be updated in-place
  ~ resource "aws_lambda_function" "event_handler_lambda" {
        id                             = "clash-bot-event-handler"
      ~ last_modified                  = "2023-11-13T06:10:51.000+0000" -> (known after apply)
      - s3_bucket                      = "clash-bot-lambda-bucket" -> null
      ~ s3_key                         = "artifacts/development/11/event-handler-11.zip" -> "event-handler-95.tar.gz"
        tags                           = {}
        # (20 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_lambda_function.event_publisher_lambda will be updated in-place
  ~ resource "aws_lambda_function" "event_publisher_lambda" {
        id                             = "clash-bot-event-publisher"
      ~ last_modified                  = "2023-11-13T06:10:57.024+0000" -> (known after apply)
      - s3_bucket                      = "clash-bot-lambda-bucket" -> null
      ~ s3_key                         = "artifacts/development/11/event-publisher-11.zip" -> "event-publisher-95.tar.gz"
        tags                           = {}
        # (20 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

Plan: 0 to add, 3 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @Poss111, Action: `pull_request`*